#include "pathfinder.h"

/**
 * Читає рядок з файлу до певного роздільника.
 *
 * @param fd Дескриптор файлу.
 * @param size Вказівник на змінну, яка зберігатиме розмір прочитаного рядка.
 * @param eof Вказівник на змінну, що визначає, чи досягнуто кінець файлу.
 * @param delim Символ, що позначає роздільник рядка.
 * @return Прочитаний рядок або NULL, якщо досягнуто кінець файлу.
 */
char *read_line_delim(int fd, int *size, int *eof, char delim) {
    // Буфер для зчитування символів
    char buffer[256];
    *size = 0; // Ініціалізація розміру
    *eof = 0;  // Ініціалізація кінця файлу

    // Початкове зчитування символа
    int res = (int)read(fd, &buffer[*size], 1);

    // Цикл зчитування символів до роздільника або кінця файлу
    while (res > 0) {
        if (buffer[*size] == delim) {
            // Виділення пам'яті для рядка
            char *str = mx_strnew(*size);
            // Копіювання вмісту буфера до нового рядка
            mx_strncpy(str, buffer, *size);
            return str;
        }

        (*size)++;
        res = (int)read(fd, &buffer[*size], 1);
    }

    // Якщо нічого не прочитано, сигналізуємо про кінець файлу
    *eof = 1;
    return NULL;
}
